# *** Принципы программирования ***

# 1. YAGNI значит You Ain’t Gonna Need It (вам это не понадобится)
#  Суть принципа: Реализуйте только поставленные задачи! Не делайте то, что не нужно.
# Избегайте сложных шаблонов, пакетов, фреймворков, которые не будут использоваться или не имеют отношения к работе.

# 2. KISS значит Keep it simple, stupid (делайте вещи проще)
# Суть принципа: Люди (включая пользователей продуктов и услуг), как правило, хотят простых вещей,
# то есть простых в освоении и использовании.
# Избегайте чрезмерного проектирования и усложнения!

# 3. DRY значит Don’t repeat yourself (не повторяйте себя)
# Иногда можно встретить другой принцип — DIE (Duplication Is Evil, дублирование — это зло)
# Суть принципа: нужно избегать повторений одного и того же кода.
# Лучше использовать универсальные свойства и функции.

# 4. SOLID (ещё один принцип)
# Single responsibility principle — принцип единственной обязанности
# (на каждый класс должна быть возложена одна единственная обязанность).
# Это как при распределении задач внутри коллектива.
# Эффективная работа строится тогда, когда каждый выполняет свою определённую задачу.

# Open/closed principle — принцип открытости/закрытости.
# Код, который вы пишете, должен быть масштабируемым, то есть должна быть возможность для его расширения.
# Но при этом внесение добавлений не должно требовать изменений в коде, который уже написан.

# Liskov substitution principle — принцип подстановки Барбары Лисков.
# Это принцип объектно-ориентированного программирования, касающийся классов, интерфейсов, типов и подтипов.
# Суть его в том, что каждый подтип должен дополнять, а не заменять базовый тип.

