# *****  Импорт классов *****
# Классы также можно передавать в другие файлы с помощью импорта.
# Рассмотрим импорт на примере класса прямоугольника.
# Дальше в файл rectangle.py

# Задание 1.8.1
# Создайте класс Cat в отдельном файле. Класс должен содержать конструктор с параметрами:
# имя, пол, возраст и методы get(), которые будут возвращать все параметры объекта.
#
# В другом файле создайте экземпляры класса.
# В качестве входных данных используйте данные о котах с сайта «Дом питомца».
# Не забудьте импортировать класс Cat в файл.
#
# Далее сделайте вывод информации о котах в консоль.